Revit 2027 API
StructuralSectionGeneralW Constructor
 Creates a new instance of Angle shape.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public StructuralSectionGeneralW(
	double width,
	double height,
	double flangeThickness,
	double webThickness,
	double webFillet,
	double flangeFillet,
	double topWebFillet,
	double centroidHorizontal,
	double centroidVertical,
	StructuralSectionAnalysisParams analysisParams
)
Public Sub New (
	width As Double,
	height As Double,
	flangeThickness As Double,
	webThickness As Double,
	webFillet As Double,
	flangeFillet As Double,
	topWebFillet As Double,
	centroidHorizontal As Double,
	centroidVertical As Double,
	analysisParams As StructuralSectionAnalysisParams
)
public:
StructuralSectionGeneralW(
	double width,
	double height,
	double flangeThickness,
	double webThickness,
	double webFillet,
	double flangeFillet,
	double topWebFillet,
	double centroidHorizontal,
	double centroidVertical,
	StructuralSectionAnalysisParams^ analysisParams
)
new :
        width : float *
        height : float *
        flangeThickness : float *
        webThickness : float *
        webFillet : float *
        flangeFillet : float *
        topWebFillet : float *
        centroidHorizontal : float *
        centroidVertical : float *
        analysisParams : StructuralSectionAnalysisParams -> StructuralSectionGeneralW
Parameters
width Double
 Section width.
height Double
 Section height, depth.
flangeThickness Double
 Flange Thickness.
webThickness Double
 Web Thickness.
webFillet Double
 Web Fillet - fillet radius between web and flange.
flangeFillet Double
 Flange Fillet - fillet radius at the flange end.
topWebFillet Double
 Top Web Fillet - fillet radius at the top of web.
centroidHorizontal Double
 Distance from centroid to the left extremites along horizontal axis.
centroidVertical Double
 Distance from centroid to the upper extremites along vertical axis.
analysisParams StructuralSectionAnalysisParams
 Common set of parameters for structural analysis.
See Also
Reference
StructuralSectionGeneralW Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace